benchmark/CVE-2019-7297/CVE-2019-7297.yml

vulnerability_id: CVE-2019-7297
affected_vendor: D-Link
firmware_version: DIR-823G
firmware_architecture: MIPS32
file_system: Squashfs
vulnerability_type: Command Injection
vulnerability_score: 9.8
vulnerability_severity: Critical
CWE_type: CWE-78
communication_protocol: SOAP、HNAP
simulation_method: FAT
vulnerability_description: An issue was discovered on D-Link DIR-823G devices with firmware through 1.02B03. A command Injection vulnerability allows attackers to execute arbitrary OS commands via shell metacharacters in a crafted /HNAP1 request. 
                           This occurs when the GetNetworkTomographyResult function calls the system function with an untrusted input parameter named Address. Consequently, an attacker can execute any command remotely when they control this input.
firmware_link: https://github.com/xinyongpeng/gitpic/blob/master/DIR823GA1_FW102B03.bin
fuzz_seed: |-
  POST /HNAP1/ HTTP/1.1
  Host: 127.0.0.1:8081
  User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/56.0.2924.76 Safari/537.36
  Accept-Encoding: gzip, deflate
  Accept: */*
  Connection: keep-alive
  SOAPAction: "http://purenetworks.com/HNAP1/SetNetworkTomographySettings"
  Content-Type: text/xml; charset=UTF-8
  Accept-Language: zh-CN,zh;q=0.9,en;q=0.8
  Content-Length: 439

  <?xml version='1.0' encoding='utf-8'?><soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>  <soap:Body>    <SetNetworkTomographySettings xmlns='http://purenetworks.com/HNAP1/'>      <Address>127.0.0.1</Address>      <Number>4</Number>          <Size>4</Size>     </SetNetworkTomographySettings></soap:Body></soap:Envelope>
